<a target="_blank" href="https://colab.research.google.com/github/victorlymarev/pandas/blob/main/notebooks/02-pandas-dtypes.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Изменение типов данных
#### [Ссылка на видео](https://youtu.be/5aZZS8rTnj0)

Импортируем библиотеки. Библитека os нужна, чтобы вы не скачивали таблицу второй раз если она у вас уже скачана, и скачалаи ее, если она у вас не скачана

In [1]:
import os
import pandas as pd

#### Проверить к какому классу относится объект, можно при помощи функции type

In [2]:
type(123)

int

In [3]:
type('123')

str

От того, к какому классу принадлежит отбъект, зависят его свойства

In [4]:
1 + 2

3

In [5]:
'1' + '2'

'12'

In [6]:
[1, 2, 3, 4, 5]

[1, 2, 3, 4, 5]

Читаем таблицу

In [7]:
path_people = '../tables/people.parquet' if os.path.exists('../tables/people.parquet') else 'https://drive.google.com/uc?id=1iI1Lde5ya3ruztGYmjpprSCUoCU9rBeS'

people = pd.read_parquet(path_people)
people

         Имя   Фамилия  Число детей  Площадь дома Дата рождения  Женат/Замужем
0       Илья  Васильев            0          56.3    1996-11-30          False
1      Антон  Алексеев            2          77.0    1976-02-29           True
2    Надежда    Гусева            3         103.1    1964-09-26           True
3      Артем    Павлов            5         134.9    1980-05-18           True
4  Александр  Николаев            1          47.0    1959-02-24           True
5    Дмитрий  Печенкин            2          61.0    1939-04-05          False
6      Дарья  Воробева            3           NaN    1997-07-23           True

In [8]:
people['Фамилия']

0    Васильев
1    Алексеев
2      Гусева
3      Павлов
4    Николаев
5    Печенкин
6    Воробева
Name: Фамилия, dtype: string

In [9]:
people['Число детей']

0    0
1    2
2    3
3    5
4    1
5    2
6    3
Name: Число детей, dtype: int64

### info

Метод выводит на экран таблицу, в которой указаны название столбца, число заполненых ячейк и тип данных в стобце

In [10]:
people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Имя            7 non-null      object
 1   Фамилия        7 non-null      string
 2   Число детей    7 non-null      int64
 3   Площадь дома   6 non-null      float64
 4   Дата рождения  7 non-null      datetime64[us]
 5   Женат/Замужем  7 non-null      bool
dtypes: bool(1), datetime64[us](1), float64(1), int64(1), object(1), string(1)
memory usage: 419.0+ bytes

In [11]:
people

         Имя   Фамилия  Число детей  Площадь дома Дата рождения  Женат/Замужем
0       Илья  Васильев            0          56.3    1996-11-30          False
1      Антон  Алексеев            2          77.0    1976-02-29           True
2    Надежда    Гусева            3         103.1    1964-09-26           True
3      Артем    Павлов            5         134.9    1980-05-18           True
4  Александр  Николаев            1          47.0    1959-02-24           True
5    Дмитрий  Печенкин            2          61.0    1939-04-05          False
6      Дарья  Воробева            3           NaN    1997-07-23           True

#### Типы:
1. __object__ - тип данных, который в основном используется для строк (строки - это текст, они записываются в кавычках), но может содержать и другие типы данных
2. __string__ - тип данных, предназначеный для хранения строк
3. __int + число__ - целые числа
4. __float + число__ - числа с плавующей точкой
5. __datetime64[ns]__ - даты и время
6. __bool__ - логический тип. Если True, то правда, если False, то ложь

In [12]:
df_path = '../tables/modified_dtypes.pkl' if os.path.exists('../tables/школьные оценки.xlsx') else 'https://drive.google.com/uc?id=1Q_MDakkji87seNz6nWH54cLF9_54Ix81'
df = pd.read_pickle(df_path)

In [13]:
df

,Имя,Фамилия,Число детей,Площадь дома,Дата рождения,Дата устройства на работу,Заработная плата,Автомобиль
0,Илья,Васильев,0,56.3,1996-11-30,12#02/2020,45000,киа
1,Антон,Алексеев,2,77.0,1976-02-29,20#12/2001,33000,рено
2,Надежда,Гусева,3,103.1,1964-09-26,09#06/1981,80000,жигули
3,Артем,Павлов,5,134.9,1980-05-18,09#09/2008,50000,бмв
4,Александр,Николаев,1,47.0,1959-02-24,03#07/2019,29000,киа
5,Дмитрий,Печенкин,2,61.0,1939-04-05,19#08/1958,100000,жигули
6,Дарья,Воробева,3,65.0,1997-07-23,20#12/2022,NaN,<NA>

Все колонки в таблице представленны типом object

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Имя                        7 non-null      object
 1   Фамилия                    7 non-null      object
 2   Число детей                7 non-null      object
 3   Площадь дома               7 non-null      object
 4   Дата рождения              7 non-null      object
 5   Дата устройства на работу  7 non-null      object
 6   Заработная плата           6 non-null      object
 7   Автомобиль                 6 non-null      object
dtypes: object(8)
memory usage: 580.0+ bytes

### to_datetime

Функция приводит колонки таблицы к типу datetime64

In [15]:
df['Дата рождения']

0    1996-11-30
1    1976-02-29
2    1964-09-26
3    1980-05-18
4    1959-02-24
5    1939-04-05
6    1997-07-23
Name: Дата рождения, dtype: object

In [16]:
pd.to_datetime(df['Дата рождения'])

0   1996-11-30
1   1976-02-29
2   1964-09-26
3   1980-05-18
4   1959-02-24
5   1939-04-05
6   1997-07-23
Name: Дата рождения, dtype: datetime64[ns]

In [17]:
df['Дата рождения']

0    1996-11-30
1    1976-02-29
2    1964-09-26
3    1980-05-18
4    1959-02-24
5    1939-04-05
6    1997-07-23
Name: Дата рождения, dtype: object

#### Присваивание новых значений

In [18]:
df['Дата рождения'] = pd.to_datetime(df['Дата рождения'])

In [19]:
df['Дата рождения']

0   1996-11-30
1   1976-02-29
2   1964-09-26
3   1980-05-18
4   1959-02-24
5   1939-04-05
6   1997-07-23
Name: Дата рождения, dtype: datetime64[ns]

#### параметр format

In [20]:
df['Дата устройства на работу']

0    12#02/2020
1    20#12/2001
2    09#06/1981
3    09#09/2008
4    03#07/2019
5    19#08/1958
6    20#12/2022
Name: Дата устройства на работу, dtype: object

In [21]:
pd.to_datetime(df['Дата устройства на работу'])

/tmp/ipykernel_5866/1390509222.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(df['Дата устройства на работу'])

DateParseError: Unknown datetime string format, unable to parse: 12#02/2020, at position 0

In [22]:
df['Дата устройства на работу'] = pd.to_datetime(df['Дата устройства на работу'],
                                                 
                                                 format='%d#%m/%Y')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Имя                        7 non-null      object
 1   Фамилия                    7 non-null      object
 2   Число детей                7 non-null      object
 3   Площадь дома               7 non-null      object
 4   Дата рождения              7 non-null      datetime64[ns]
 5   Дата устройства на работу  7 non-null      datetime64[ns]
 6   Заработная плата           6 non-null      object
 7   Автомобиль                 6 non-null      object
dtypes: datetime64[ns](2), object(6)
memory usage: 580.0+ bytes

In [24]:
pd.to_datetime('03/24/2016 12:27:11', format ='%m/%d/%Y %H:%M:%S')

Timestamp('2016-03-24 12:27:11')

### astype

Метод для конвертации колонок из одного типа в другой

#### Синтаксис:
__Для датафреймов:__
1. df.astype({Назавание колонки: тип}) - для приведения определенных колонок
2. df.astype(тип) - для приведения всего датафрема к одному типу

__Для объектов Series:__
1. s.astype(тип)

In [25]:
df.astype({'Число детей': int, 'Площадь дома': float})

,Имя,Фамилия,Число детей,Площадь дома,Дата рождения,Дата устройства на работу,Заработная плата,Автомобиль
0,Илья,Васильев,0,56.3,1996-11-30,2020-02-12,45000,киа
1,Антон,Алексеев,2,77.0,1976-02-29,2001-12-20,33000,рено
2,Надежда,Гусева,3,103.1,1964-09-26,1981-06-09,80000,жигули
3,Артем,Павлов,5,134.9,1980-05-18,2008-09-09,50000,бмв
4,Александр,Николаев,1,47.0,1959-02-24,2019-07-03,29000,киа
5,Дмитрий,Печенкин,2,61.0,1939-04-05,1958-08-19,100000,жигули
6,Дарья,Воробева,3,65.0,1997-07-23,2022-12-20,NaN,<NA>

In [26]:
df.astype({'Число детей': int, 'Площадь дома': float}).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Имя                        7 non-null      object
 1   Фамилия                    7 non-null      object
 2   Число детей                7 non-null      int64
 3   Площадь дома               7 non-null      float64
 4   Дата рождения              7 non-null      datetime64[ns]
 5   Дата устройства на работу  7 non-null      datetime64[ns]
 6   Заработная плата           6 non-null      object
 7   Автомобиль                 6 non-null      object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 580.0+ bytes

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Имя                        7 non-null      object
 1   Фамилия                    7 non-null      object
 2   Число детей                7 non-null      object
 3   Площадь дома               7 non-null      object
 4   Дата рождения              7 non-null      datetime64[ns]
 5   Дата устройства на работу  7 non-null      datetime64[ns]
 6   Заработная плата           6 non-null      object
 7   Автомобиль                 6 non-null      object
dtypes: datetime64[ns](2), object(6)
memory usage: 580.0+ bytes

#### С помощью метода astype можно обрезать дробную часть у чисел с плавующей точкой

In [28]:
df.astype({'Число детей': int, 'Площадь дома': float}).astype({'Площадь дома': int})

,Имя,Фамилия,Число детей,Площадь дома,Дата рождения,Дата устройства на работу,Заработная плата,Автомобиль
0,Илья,Васильев,0,56,1996-11-30,2020-02-12,45000,киа
1,Антон,Алексеев,2,77,1976-02-29,2001-12-20,33000,рено
2,Надежда,Гусева,3,103,1964-09-26,1981-06-09,80000,жигули
3,Артем,Павлов,5,134,1980-05-18,2008-09-09,50000,бмв
4,Александр,Николаев,1,47,1959-02-24,2019-07-03,29000,киа
5,Дмитрий,Печенкин,2,61,1939-04-05,1958-08-19,100000,жигули
6,Дарья,Воробева,3,65,1997-07-23,2022-12-20,NaN,<NA>

Более красивый вид написания методов

In [29]:
(df
    .astype({'Число детей': int, 'Площадь дома': float})
#     .astype({'Площадь дома': int})
)

,Имя,Фамилия,Число детей,Площадь дома,Дата рождения,Дата устройства на работу,Заработная плата,Автомобиль
0,Илья,Васильев,0,56.3,1996-11-30,2020-02-12,45000,киа
1,Антон,Алексеев,2,77.0,1976-02-29,2001-12-20,33000,рено
2,Надежда,Гусева,3,103.1,1964-09-26,1981-06-09,80000,жигули
3,Артем,Павлов,5,134.9,1980-05-18,2008-09-09,50000,бмв
4,Александр,Николаев,1,47.0,1959-02-24,2019-07-03,29000,киа
5,Дмитрий,Печенкин,2,61.0,1939-04-05,1958-08-19,100000,жигули
6,Дарья,Воробева,3,65.0,1997-07-23,2022-12-20,NaN,<NA>

In [30]:
(df
    .astype({'Число детей': int})
    .query('`Число детей` > 1') # Выбираем людей, у которых хотя бы 2 ребенка
    ['Заработная плата'] # выбираем только колонку с заработной платой
    .astype(float) # меняем тип данных на float
    .mean() # считаем среднее значение
)

65750.0

Int64 может содержать пропущенные значения

In [31]:
df['Заработная плата']

0     45000
1     33000
2     80000
3     50000
4     29000
5    100000
6       NaN
Name: Заработная плата, dtype: object

In [32]:
df['Заработная плата'].astype(int)

ValueError: cannot convert float NaN to integer

In [42]:
df['Заработная плата'].astype(float)

0     45000.0
1     33000.0
2     80000.0
3     50000.0
4     29000.0
5    100000.0
6         NaN
Name: Заработная плата, dtype: float64

In [43]:
df['Заработная плата'].astype('Int64')

0     45000
1     33000
2     80000
3     50000
4     29000
5    100000
6      <NA>
Name: Заработная плата, dtype: Int64

In [44]:
df['Автомобиль']

0       киа
1      рено
2    жигули
3       бмв
4       киа
5    жигули
6      <NA>
Name: Автомобиль, dtype: object

In [45]:
df['Автомобиль'].astype('string').info()

<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Автомобиль
Non-Null Count  Dtype
--------------  -----
6 non-null      string
dtypes: string(1)
memory usage: 188.0 bytes

In [46]:
df['Автомобиль'].astype(str).info()

<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Автомобиль
Non-Null Count  Dtype
--------------  -----
7 non-null      object
dtypes: object(1)
memory usage: 188.0+ bytes

# Задания

#### Описание таблиц лежит [здесь](https://github.com/victorlymarev/pandas/tree/main/tables#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86)

Некоторые таблицы занимают много памяти, поэтому каждые 5-10 заданий лучше перезапускайте ноутбук.

В формулировке некоторых заданий может содержаться вариативность. Если у вас есть сомнения, что требуется в задании, попробуйте решить несколько вариантов. Если вы не понимаете задание, можете написать об этом в комментариях под видео.

В большинстве случаев внешний вид итоговой таблицы не определен. Выведите на экран наиболее адекватный вариант. То есть таблицу, из которой можно будет сделать выводы.

Курс пока находится в разработке. Вы можете помочь другим людям добавив свое решение [сюда](https://docs.google.com/forms/d/1HYTBz_KfssY3Jps2dC3n0YnEqa6WBb5OIhLo1d32Xzw/edit).

Посмотреть решения других людей можно [здесь](https://docs.google.com/spreadsheets/d/1pMDYO-9UneLbPPnEuQ2shig0TOJdQTU-zipifyAnZMk/edit?resourcekey#gid=1998648012)

### Задание 1
В таблице w_ends для каждой даты отмечено, был ли этот день выходным. Посмотрите на типы данных в таблице. Приведите колонку с датами к типу datetime64[ns]

In [34]:
import os
import pandas as pd

path_w_ends = '../tables/выходные.csv' if os.path.exists('../tables/выходные.csv') else 'https://drive.google.com/uc?id=1hAsoXSPTFihFmBuF-E0uSj9pX4gpojwC'
w_ends = pd.read_csv(path_w_ends)
w_ends = pd.to_datetime(w_ends["Дата"])
w_ends.info()

<class 'pandas.core.series.Series'>
RangeIndex: 2922 entries, 0 to 2921
Series name: Дата
Non-Null Count  Dtype
--------------  -----
2922 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 23.0 KB

In [45]:
w_ends = pd.to_datetime(w_ends["Дата"])

In [46]:
w_ends.info()

<class 'pandas.core.series.Series'>
RangeIndex: 2922 entries, 0 to 2921
Series name: Дата
Non-Null Count  Dtype
--------------  -----
2922 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 23.0 KB

### Задание 2

Приведите колонку Математика к типу string, а колонку Литература к строкам. Таблица лежит в переменной marks

In [35]:
import os
import pandas as pd

path_marks = '../tables/оценки.xlsx' if os.path.exists('../tables/оценки.xlsx') else 'https://drive.google.com/uc?id=17f4DXx53J0WooNkhO13xidseZJ-O2obs'
marks = pd.read_excel(path_marks)
marks
marks['Математика'] = marks['Математика'].astype('string')
marks["Литература"] = marks["Литература"].astype(str)
marks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ФИО                  19 non-null     object
 1   Пол                  19 non-null     object
 2   Математика           19 non-null     string
 3   Русский язык         19 non-null     int64
 4   Литература           19 non-null     object
 5   Физика               19 non-null     int64
 6   История              19 non-null     int64
 7   Физическая культура  19 non-null     int64
dtypes: int64(4), object(3), string(1)
memory usage: 1.3+ KB

### Задание 3

В дальнейшем вы будете работать с таблицами, которые будут содержать информацию о магазинах одежды. В таблице shops лежать адреса этих магазинов, и дата открытия.

Изучите таблицу, посмотрите на типы данных в ней. Приведите колонки таблицы к форматам, которые вам кажутся наиболее подходящими

In [36]:
import os
import pandas as pd

path_shops = '../tables/shops.xlsx' if os.path.exists('../tables/shops.xlsx') else 'https://drive.google.com/uc?id=1gfnmceJa3Mc1X06NftTx9G9QfKfprjEB'
shops = pd.read_excel(path_shops).astype({'shop_id': str})
shops
shops = shops.astype({'shop_id': int,'size': str, 'city': str, 'shopping_center': str})

In [53]:
shops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   shop_id          23 non-null     int64
 1   city             23 non-null     object
 2   adress           23 non-null     object
 3   shopping_center  23 non-null     object
 4   size             23 non-null     object
 5   open_date        23 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 1.2+ KB

### Задание 4

В таблице empl приведите колонку salary (зарплата) к целым числам

In [37]:
import os
import pandas as pd

path_empl = '../tables/employees.parquet' if os.path.exists('../tables/employees.parquet') else 'https://drive.google.com/uc?id=1AARD5-eVlCxoApt5CYZebrC3Cqw42lvj'

empl = pd.read_parquet(path_empl)
empl['salary'].astype('Int64')

0        45700
1        20000
2        12600
3        12600
4        15400
         ...
29367    38000
29368    31800
29369    28400
29370    35500
29371    26400
Name: salary, Length: 29372, dtype: Int64

### Задание 5

В таблите ltc лежат данные по курсу криптовалюты litecoin. Посмотрите на типы данных в таблице. Приведите колнку date к типу datetime64. Используйте параметр format. (На самом деле функция to_datetime сработает и без него, но лучше попрактикуйтесь с ним). Подсказка  о том, как это сделать содержится внутри метода strftime. На остальные методы пока внимание не обращайте

In [38]:
import os
import pandas as pd

path_ltc_sample = '../tables/ltc_sample.parquet' if os.path.exists('../tables/ltc_sample.parquet') else 'https://drive.google.com/uc?id=1XaThogOOqKjJj50LvfJ9WqutjMAC5AxA'

ltc = (pd.read_parquet(path_ltc_sample)
       .head(10)
       .assign(date = lambda x: x['date'].dt.strftime('%H:%M:%S %d/%m/%Y'))
)
ltc['date'] = pd.to_datetime(ltc['date'], format='%H:%M:%S %d/%m/%Y')

ltc

                 date  price     volume
0 2013-11-13 15:00:56   5.00  12.874000
1 2013-11-13 15:58:20   5.00   0.900000
2 2013-11-16 18:58:57   4.30   0.067440
3 2013-11-16 18:59:16   4.25   5.000000
4 2013-11-19 03:24:48   9.90   0.117018
5 2013-11-19 03:27:08   9.90   0.817538
6 2013-11-19 04:08:36   9.90   0.002367
7 2013-11-19 04:17:55   9.90   0.039006
8 2013-11-19 04:24:57   9.90   0.011796
9 2013-11-19 08:22:00  10.00   0.059100

In [39]:
ltc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    10 non-null     datetime64[ns]
 1   price   10 non-null     float64
 2   volume  10 non-null     float64
dtypes: datetime64[ns](1), float64(2)
memory usage: 372.0 bytes

### Задание 6

Посмотрите на таблицу xdg_usdt. В ней содержаться данные по торговли криптовалютами xdg и usdt.
В ней нас интересует колонка дата. Посмотрите какого она типа?

Иногда даты хранятся не в виде строк, а в виде целых чисел. Каждое число - это количество секунд, милисекунд или наносекунд, которое прошло с 1 января 1970 года. Привести такую колонку к привычному формату дат можно при помощи функции to_datetime, используя в ней парметр unit. Этому параметру необходимо передать значение 's' для секунд, 'ms' - для милисекунд, 'ns' - для наносекунд. 

Приведите колонку с датами к типу datetime64, подобрав нужное значение в параметре unit

In [52]:
import os
import pandas as pd
path_xdg_usdt = '../tables/XDGUSDT.csv' if os.path.exists('../tables/XDGUSDT.csv') else 'https://drive.google.com/uc?id=1oLjCNOsdKbd87sIgW0_OWDpD2DVHAAAV'
xdg_usdt = pd.read_csv(path_xdg_usdt, header=None).set_axis(['Дата', 'Цена', 'Объем'], axis=1)
xdg_usdt

             Дата     Цена         Объем
0      1680307512  0.07697   1717.759130
1      1680307665  0.07712    155.601660
2      1680308198  0.07733    300.000000
3      1680308304  0.07728   1269.038017
4      1680308700  0.07705   2513.470011
...           ...      ...           ...
35583  1688164175  0.06637    100.000000
35584  1688166367  0.06645   1947.861352
35585  1688167824  0.06639   3699.770000
35586  1688167866  0.06641    828.188526
35587  1688168200  0.06637  15000.000000

[35588 rows x 3 columns]

In [53]:
xdg_usdt['Дата'] = pd.to_datetime(xdg_usdt['Дата'], unit='s')

In [54]:
xdg_usdt

                     Дата     Цена         Объем
0     2023-04-01 00:05:12  0.07697   1717.759130
1     2023-04-01 00:07:45  0.07712    155.601660
2     2023-04-01 00:16:38  0.07733    300.000000
3     2023-04-01 00:18:24  0.07728   1269.038017
4     2023-04-01 00:25:00  0.07705   2513.470011
...                   ...      ...           ...
35583 2023-06-30 22:29:35  0.06637    100.000000
35584 2023-06-30 23:06:07  0.06645   1947.861352
35585 2023-06-30 23:30:24  0.06639   3699.770000
35586 2023-06-30 23:31:06  0.06641    828.188526
35587 2023-06-30 23:36:40  0.06637  15000.000000

[35588 rows x 3 columns]

In [55]:
# Пример того, как это работает
pd.to_datetime([1234567890, 973401234, 2536234589], unit='s')

DatetimeIndex(['2009-02-13 23:31:30', '2000-11-05 05:13:54',
               '2050-05-15 13:36:29'],
              dtype='datetime64[ns]', freq=None)

In [ ]:
# напишите свой код здесь

### Задание 7

В видео была допущена ошибка, когда было сказано, что можно поменять формат отображения дат. Это не так. Даты можно представить в виде строк в определенном формате. Для того, чтобы это сделать необходимо обратиться к колонке с датами, а затем обратиться к конструкции dt.strftime(). Внутри метода надо указать формат даты. 

Приведите колонку open_date к строкам, чтобы дата лежала в формате число, месяц, год.  В качестве разделителей возьмите слэш /

In [56]:
import os
import pandas as pd

path_shops = '../tables/shops.xlsx' if os.path.exists('../tables/shops.xlsx') else 'https://drive.google.com/uc?id=1gfnmceJa3Mc1X06NftTx9G9QfKfprjEB'

shops = pd.read_excel(path_shops)
shops.head()

,shop_id,city,adress,shopping_center,size,open_date
0,1,Воронеж,"Пушкинская пл., д. 76",NaN,Мелкий,2015-01-22
1,2,Санкт-Петербург,"ул. Веселая, д. 20",Книга,Крупный,2015-05-11
2,3,Чита,"Тупой пер., д. 1",NaN,Мелкий,2015-11-27
3,4,Липецк,"пр. Гагарина, д. 234",Обезьяна,Средний,2016-04-04
4,5,Челябинск,"пр. Железнодорожников, д. 12",NaN,Мелкий,2016-04-11

In [57]:
shops['open_date'].dt.strftime('%d/%m/%Y's)

0     22/01/2015
1     11/05/2015
2     27/11/2015
3     04/04/2016
4     11/04/2016
5     19/04/2016
6     17/01/2017
7     08/02/2017
8     10/05/2017
9     13/08/2017
10    18/12/2017
11    31/12/2017
12    04/02/2018
13    30/03/2018
14    30/04/2018
15    23/05/2018
16    18/07/2018
17    22/01/2019
18    24/02/2019
19    27/06/2019
20    13/08/2019
21    05/11/2020
22    09/12/2020
Name: open_date, dtype: object

In [58]:
shops["open_date"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 23 entries, 0 to 22
Series name: open_date
Non-Null Count  Dtype
--------------  -----
23 non-null     datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 316.0 bytes